fonecmid-diplom/src/Documents/ВКМ_НачислениеФиксированнойПремии/ВКМ_НачислениеФиксированнойПремии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеФиксированнойПремии</name>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ДополнительныеНачисления</registerRecords>
  <tabularSections>
    <name>СписокСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>НДФЛ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ДополнительныеНачисления/ВКМ_ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ДополнительныеНачисления</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_Удержания/ВКМ_Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_Удержания</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_НачислениеФиксированнойПремии/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	РассчитатьНДФЛ();
	ЗаполнитьДвиженияНачислений();
	ЗаполнитьДвиженияВзаиморасчетов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура РассчитатьНДФЛ()
	
	КоэффициентНДФЛ = Константы.ВКМ_ПроцентНДФЛ.КоэффициентНДФЛ();
	
	Для Каждого Строка Из СписокСотрудников Цикл
		Строка.НДФЛ = Окр(Строка.СуммаПремии * КоэффициентНДФЛ, 2);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДвиженияНачислений()
	
	ПланВидовРасчетаПремия = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия;
	ПланВидовРасчетаНДФЛ   = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
	
	НачалоПериода = НачалоМесяца(Дата);
	КонецПериода  = КонецМесяца(Дата);
	
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	Движения.ВКМ_ДополнительныеНачисления.Очистить();
	Движения.ВКМ_Удержания.Записывать = Истина;
	Движения.ВКМ_Удержания.Очистить();
	
	Для Каждого Строка Из СписокСотрудников Цикл
		
		ДвиженияПремия = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		ДвиженияПремия.ПериодРегистрации = НачалоПериода;
		ДвиженияПремия.ВидРасчета        = ПланВидовРасчетаПремия;
		ДвиженияПремия.Сотрудник         = Строка.Сотрудник;
		ДвиженияПремия.Результат         = Строка.СуммаПремии;
		
		ДвиженияНДФЛ = Движения.ВКМ_Удержания.Добавить();
		ДвиженияНДФЛ.ПериодРегистрации = НачалоПериода;
		ДвиженияНДФЛ.ВидРасчета        = ПланВидовРасчетаНДФЛ;
		ДвиженияНДФЛ.Сотрудник         = Строка.Сотрудник;
		ДвиженияНДФЛ.Результат         = Строка.НДФЛ;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДвиженияВзаиморасчетов()
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Очистить();
	
	Для Каждого Строка Из СписокСотрудников Цикл
		
		СуммаКВыплате = Строка.СуммаПремии - Строка.НДФЛ;
		
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период      = Дата;
		Движение.Сотрудник   = Строка.Сотрудник;
		Движение.Сумма       = СуммаКВыплате;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
